HELYXcore-4.4.0/modules/swak4Foam/Examples/Lagrangian/parser/parcelInBoxWithExpressions/system/controlDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingParcelFoam;

startFoam       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   1e-1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           5;

maxDeltaT       1e-3;


libs (
    "libsimpleSwakFunctionObjects.so"
    "libswakLagrangianParser.so"
);

functions {
    cloudPosition {
        type swakExpression;
        outputControlMode timeStep;
        expression "pos()";
        accumulations (
            min
            max
            average
            weightedAverage
        );
        verbose true;

        valueType cloud;
        cloudName reactingCloud1;
    }
    cloudWeights {
        $cloudPosition;
        expression "weight()";
        //   alternateCloudType Cloud<basicKinematicParcel;
    }
    cloudIds {
        $cloudPosition;
        expression "origId";
    }
<!--(if foamFork=="openfoam" and foamVersion>=(5,))-->
<!--(elif foamFork=="openfoamplus" and foamVersion>=(1712,))-->
<!--(else)-->
    cloudSoftImpact {
        $cloudPosition;
        expression "softImpact";
    }
    cloudCurrentTime {
        $cloudPosition;
        expression "currentTime";
    }
<!--(end)-->
    cloudStepFraction {
        $cloudPosition;
        expression "stepFraction";
    }
    cloudWaterMass {
        $cloudPosition;
<!--(if foamFork=="extend")-->
        aliases {
            YLiquid_H2O YH2O;
        }
<!--(end)-->
        expression "YLiquid_H2O*mass";
    }
    cloudRelativeMass {
        $cloudPosition;
        expression "mass/mass0";
    }
    cloudTemperatureChange {
        $cloudPosition;
        expression "T-T0";
    }
    cloudTemperatureDiff {
        $cloudPosition;
        expression "T-fluidPhase(T)";
        interpolationSchemes {
            T cellPoint;
        }
    }
    cloudVelocityDifference {
        $cloudPosition;
        expression "U-fluidPhase(U)";
        interpolationSchemes {
            U cellPoint;
        }
    }
    cloudVelocityDifferenceFace {
        $cloudVelocityDifference;
        interpolationSchemes {
            U cellPointFace;
        }
    }
    cloudVelocityDifferenceCell {
        $cloudVelocityDifference;
        interpolationSchemes {
            U cell;
        }
    }
}

// ************************************************************************* //
