HELYXcore-4.4.0/modules/swak4Foam/Examples/Lagrangian/parser/parcelInBoxWithExpressions/constant/reactions.inp
species
(
    O2
    H2O
    N2
)
;

reactions
(
);
